app/views/movies/index.html.erb

      <th class="<%= (("hilite" + ' ' + "p-3 mb-2 bg-warning text-dark") if @sort == "title") %>">
        <%= link_to 'Movie Title', movies_path(:sort => 'title',
         :ratings => Hash[@ratings_to_show.map {|rating| [rating, 1]}]), :id => "title_header" %>
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R')  ORDER BY "movies"."title" ASC