app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G'  ORDER BY release_date
---
    def index
      @sort = params[:sort] || session[:sort]
      order = {title: :asc} if @sort == 'title'
      order = {release_date: :asc} if @sort == 'release_date'
      @all_ratings = Movie.all_ratings
      ratings_to_show_hash = params[:ratings] || session[:ratings] || @all_ratings.map{ |r| [rating, 1] }.to_h